src/Counties/M5002704/.Campo_Grande_MS

Padrão: DSFNET
Codigo Municipio IBGE: 5002704
Codigo Cidade SIAFI: 9051
SOAP Version: 1.1
Signature Method: SHA1
Using CData: true ??
URL: http://issdigital.pmcg.ms.gov.br/WsNFe2/LoteRps.jws?wsdl
TESTE: http://200.201.194.78/WsNFe2/LoteRps.jws?wsdl
xmlns: 

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:proc="http://proces.wsnfe2.dsfnet.com.br">
   <soapenv:Header/>
   <soapenv:Body>
      <proc:cancelar soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <mensagemXml xsi:type="xsd:string">?</mensagemXml>
      </proc:cancelar>
   </soapenv:Body>
</soapenv:Envelope>